{
   "Duplicati - by Linuxserver.io":{
      "containers":{
         "duplicati-lsio": {
            "image": "linuxserver/duplicati",
            "tag": "latest",
            "launch_order": 1,
            "ports": {
               "8200": {
                  "description": "Duplicati WebUI port. Suggested default: 8200",
                  "host_default": 8200,
                  "label": "WebUI port",
                  "protocol": "tcp",
                  "ui": true
               }
            },
            "volumes": {
               "/config": {
                  "description": "Choose a Share for Duplicati configuration. Eg: create a Share called duplicati-config for this purpose alone.",
                  "label": "Config Storage"
               }
            },
            "environment": {
               "PUID": {
                  "description": "Enter a valid UID of an existing user with permission to shares.",
                  "label": "PUID",
                  "index": 1
               },
               "PGID": {
                  "description": "Enter a valid GID of an existing group with permission to shares.",
                  "label": "PGID",
                  "index": 2
               }
            }
         }
      },
      "description":"Duplicati is a backup client that securely stores encrypted, incremental, compressed backups on cloud storage services and remote file servers.<p>Based on a custom docker image: <a href='https://hub.docker.com/r/linuxserver/duplicati' target='_blank'>https://hub.docker.com/r/linuxserver/duplicati</a>, available for amd64 and arm64 architecture.</p>",
      "more_info": "<h4>Make other Rockstor shares accessible</h4><p>While Duplicati can be used to backup any Rockstor share, they must first be made accessible to this rock-on. To do so, simply open its settings (little wrench icon), then click on 'Add Storage' and add any share you would like to backup. See <a href='http://rockstor.com/docs/docker-based-rock-ons/overview.html#add-storage' target='_blank'>Rockstor documentation</a> for instructions.</p><h4>Migration from older rock-on</h4><p>If you were using our previous Duplicati rock-on, it is possible to migrate all backups setup to this new rock-on.<ul><li>1. Make sure to install this rock-on using the same share for config; all backups that were previously set will be automatically detected</li><li>2. Update the database path for each backup. Expand the 'Advanced' section for the given backup, and update the path by replacing <code>/root/.config/Duplicati</code> with <code>/config</code>.</li></ul></p><h4>Rock-on update</h4><p>While Duplicati can be updated from within its own UI, it is <strong>not</strong> recommended to do so in order to prevent any conflict upon re-installation. Instead, it is recommended to uninstall the rock-on, and re-install it using the same shares (no data will be lost).</p>",
      "ui":{
         "slug":""
      },
      "volume_add_support":true,
      "website":"https://www.duplicati.com",
      "version":"1.1"
   }
}
