{
  "Plex": {
    "containers": {
      "plex-linuxserver.io": {
        "image": "linuxserver/plex",
        "opts": [
          [
            "--net=host",
            ""
          ]
        ],
        "launch_order": 1,
        "devices": {
          "/dev/dri": {
            "description": "Optional device path for enabling Intel QuickSync. Leave blank if not needed.",
            "label": "QuickSync device [e.g. /dev/dri]"
          }
        },
        "ports": {
          "32400": {
            "description": "Web-UI port.",
            "host_default": 32400,
            "label": "Web-UI port [e.g. 32400]",
            "ui": true
          }
        },
        "volumes": {
          "/config": {
            "description": "Plex configuration. It is important that the owner/group specified later have full access to the share (R/W/E)",
            "label": "Config Storage [e.g. plex-config]"
          },
          "/data": {
            "description": "Plex content (your media). You can also assign other media Shares on the system after installation. This share needs to have at least Read/Execute access for the user and group specified later",
            "label": "Data Storage [e.g. plex-data]"
          }
        },
        "environment": {
          "VERSION": {
            "description": "Enter version of Plex.",
            "label": "VERSION [e.g. latest]",
            "index": 1
          },
          "PUID": {
            "description": "Enter a valid UID to run Plex with. It must have full permissions to all Shares mapped in the previous step.",
            "label": "UID",
            "index": 2
          },
          "PGID": {
            "description": "Enter a valid GID to use along with the above UID. It (or the above UID) must have full permissions to all Shares mapped in the previous step.",
            "label": "GID",
            "index": 3
          }
        }
      }
    },
    "description": "Organize and stream your personal media collection of movies, TV, music, and photos anywhere on all your devices. <a href='http://rockstor.com/docs/docker-based-rock-ons/plex-media-server.html' target='_blank'>Rock-on guide</a>.<p>This rock-on supports hardware transcoding (optional) via Intel QuickSync -- see <a href='https://ark.intel.com/content/www/us/en/ark/search/featurefilter.html?productType=873&0_QuickSyncVideo=True' target='_blank'>Intel ark</a> to check your processor's compatibility.</p><p>Based on a <a href='https://hub.docker.com/r/linuxserver/plex' target='_blank'>custom OCI image</a>, available for amd64 and arm64 architecture.</p>",
    "more_info": "<h4>Adding more media to Plex</h4><p>First, add the share(s) containing your additional media to this rock-on using its settings wizard. Then, from Plex webUI, you can add this/these share(s) and re-index your library. See <a href='http://rockstor.com/docs/docker-based-rock-ons/plex-media-server.html#adding-shares-to-plex' target='_blank'>Rockstor's documentation</a> for detailed instructions.</p> <h4>Hardware transcoding using Intel QuickSync</h4>If you have a compatible processor and filled the <em>QuickSync device</em> field during the rock-on installation, please note that you also need to add a dedicated share (named <em>plex-transcoding</em>, for instance) mapped as <code>/transcode</code> that will be used for transcoding only. Then, from Plex WebUI, you can update the <strong>transcode</strong> directory setting.</p>",
    "ui": {
      "slug": "web"
    },
    "volume_add_support": true,
    "website": "https://www.plex.tv",
    "version": "1.1"
  }
}
